# SQL Subqueries - Lab

## Introduction

Now that you've seen how subqueries work, it's time to get some practice writing them! Not all of the queries will require subqueries, but all will be a bit more complex and require some thought and review about aggregates, grouping, ordering, filtering, joins and subqueries. Good luck!  

## Objectives

You will be able to:

* Write subqueries to decompose complex queries

## CRM Database Schema

Once again, here's the schema for the CRM database you'll continue to practice with.

<img src="images/Database-Schema.png" width="600">

## Connect to the Database

As usual, start by importing the necessary packages and connecting to the database **data.sqlite**.

In [2]:
#Your code here; import the necessary packages
import sqlite3
con = sqlite3.connect("data.sqlite")
c = con.cursor()

In [3]:
#Your code here; create the connection and cursor
conn = sqlite3.connect('data.sqlite')
c = conn.cursor()

## Select the Average Number of Orders on a Product by Product Basis

In [4]:
#Your code here; use a subquery. No join will be necessary.
c.execute('''select AVG(average) from (SELECT count(*) as average from orderDetails group by productCode)     ''').fetchall()

[(27.486238532110093,)]

## Write an Equivalent Query using a Subquery

```SQL
select customerNumber,
       contactLastName,
       contactFirstName
       from customers
       join orders 
       using(customerNumber)
       where orderDate = '2003-01-31';
```

In [5]:
#Your code here; use a subquery. No join will be necessary.

c.execute( """ select customerNumber,
       contactLastName,
       contactFirstName
       from customers
       join orders 
       using(customerNumber)
       where orderDate = '2003-01-31';""").fetchall()

[('141', 'Freyre', 'Diego ')]

## Select the Total Number of Orders for Each Product Name

Sort the results by the total number of items sold for that product.

In [6]:
#Your code here
#c.execute('''select total, productCode from (SELECT count(*) as total, 
#             productCode from orderDetails group by productCode) order by total;     ''').fetchall()



c.execute(''' select p.productName, count(*) as total from 
              orders o,
              orderDetails od,
              products p 
              where (od.orderNumber=o.orderNumber and
                     p.productCode=od.productCode)
              group by p.productCode
              order by total DESC;     ''').fetchall()

[('1992 Ferrari 360 Spider red', 53),
 ('1969 Harley Davidson Ultimate Chopper', 28),
 ('1952 Alpine Renault 1300', 28),
 ('1996 Moto Guzzi 1100i', 28),
 ('2003 Harley-Davidson Eagle Drag Bike', 28),
 ('1972 Alfa Romeo GTA', 28),
 ('1962 LanciaA Delta 16V', 28),
 ('1958 Setra Bus', 28),
 ('2002 Suzuki XREO', 28),
 ('1957 Chevy Pickup', 28),
 ('1940 Ford Pickup Truck', 28),
 ('1937 Lincoln Berline', 28),
 ('1936 Mercedes-Benz 500K Special Roadster', 28),
 ('1980s Black Hawk Helicopter', 28),
 ('1998 Chrysler Plymouth Prowler', 28),
 ('1964 Mercedes Tour Bus', 28),
 ('1932 Model A Ford J-Coupe', 28),
 ('1926 Ford Fire Engine', 28),
 ('P-51-D Mustang', 28),
 ('1936 Harley Davidson El Knucklehead', 28),
 ('1928 Mercedes-Benz SSK', 28),
 ('1913 Ford Model T Speedster', 28),
 ('1934 Ford V8 Coupe', 28),
 ('1999 Yamaha Speed Boat', 28),
 ('18th Century Vintage Horse Carriage', 28),
 ('1917 Maxwell Touring Car', 28),
 ('1941 Chevrolet Special Deluxe Cabriolet', 28),
 ('1940s Ford truck', 28),
 ('1939 Cadillac Limousine', 28),
 ('1970 Dodge Coronet', 28),
 ('1997 BMW R 1100 S', 28),
 ('1928 British Royal Navy Airplane', 28),
 ('1939 Chevrolet Deluxe Coupe', 28),
 ('1960 BSA Gold Star DBD34', 28),
 ('1938 Cadillac V-16 Presidential Limousine', 28),
 ('1962 Volkswagen Microbus', 28),
 ('1958 Chevy Corvette Limited Edition', 28),
 ('1900s Vintage Bi-Plane', 28),
 ('1937 Horch 930V Limousine', 28),
 ('1940 Ford Delivery Sedan', 28),
 ('Corsair F4U ( Bird Cage)', 28),
 ('1936 Chrysler Airflow', 28),
 ('1900s Vintage Tri-Plane', 28),
 ('1980â€™s GM Manhattan Express', 28),
 ('1997 BMW F650 ST', 28),
 ('1954 Greyhound Scenicruiser', 28),
 ('1996 Peterbilt 379 Stake Bed with Outrigger', 28),
 ('1928 Ford Phaeton Deluxe', 28),
 ('1930 Buick Marquette Phaeton', 28),
 ('Diamond T620 Semi-Skirted Tanker', 28),
 ('American Airlines: B767-300', 28),
 ('HMS Bounty', 28),
 ('America West Airlines B757-200', 28),
 ('1982 Camaro Z28', 28),
 ('ATA: B757-300', 28),
 ('F/A 18 Hornet 1/72', 28),
 ('American Airlines: MD-11S', 28),
 ('Boeing X-32A JSF', 28),
 ('1968 Ford Mustang', 27),
 ('2001 Ferrari Enzo', 27),
 ('1969 Corvair Monza', 27),
 ('1968 Dodge Charger', 27),
 ('1969 Ford Falcon', 27),
 ('1970 Plymouth Hemi Cuda', 27),
 ('1969 Dodge Charger', 27),
 ('1993 Mazda RX-7', 27),
 ('1948 Porsche 356-A Roadster', 27),
 ('1995 Honda Civic', 27),
 ('1903 Ford Model A', 27),
 ('Collectable Wooden Train', 27),
 ('1969 Dodge Super Bee', 27),
 ('1976 Ford Gran Torino', 27),
 ('1957 Vespa GS150', 27),
 ('1970 Triumph Spitfire', 27),
 ('1904 Buick Runabout', 27),
 ('1957 Corvette Convertible', 27),
 ('18th century schooner', 27),
 ('1982 Ducati 900 Monster', 27),
 ('1982 Lamborghini Diablo', 27),
 ('1912 Ford Model T Delivery Wagon', 27),
 ('1971 Alpine Renault 1600s', 27),
 ('1956 Porsche 356A Coupe', 27),
 ('1992 Porsche Cayenne Turbo Silver', 27),
 ('1961 Chevrolet Impala', 27),
 ('1982 Ducati 996 R', 27),
 ("1950's Chicago Surface Lines Streetcar", 27),
 ('1974 Ducati 350 Mk3 Desmo', 27),
 ('1962 City of Detroit Streetcar', 27),
 ('2002 Yamaha YZR M1', 27),
 ('The Schooner Bluenose', 27),
 ('The Mayflower', 27),
 ('The USS Constitution Ship', 27),
 ('The Titanic', 27),
 ('The Queen Mary', 27),
 ('Pont Yacht', 27),
 ('1965 Aston Martin DB5', 25),
 ('1917 Grand Touring Sedan', 25),
 ('1911 Ford Town Car', 25),
 ('1999 Indy 500 Monte Carlo SS', 25),
 ('1948 Porsche Type 356 Roadster', 25),
 ('1932 Alfa Romeo 8C2300 Spider Sport', 25),
 ('1970 Chevy Chevelle SS 454', 25),
 ('1966 Shelby Cobra 427 S/C', 25),
 ('1949 Jaguar XK 120', 25),
 ('1969 Chevrolet Camaro Z28', 25),
 ('2002 Chevy Corvette', 25),
 ('1936 Mercedes Benz 500k Roadster', 25),
 ('1957 Ford Thunderbird', 24),
 ('1952 Citroen-15CV', 24)]

## Select the Product Name and the  Total Number of People Who Have Ordered Each Product

Sort the results in descending order.

In [7]:
#Your code herse
#Your code here
c.execute(''' select c.customerName, p.productName, count(*) as total from 
              customers c, 
              orders o,
              orderDetails od,
              products p 
              where (od.orderNumber=o.orderNumber and
                     c.customerNumber=o.customerNumber and
                     p.productCode=od.productCode)
              group by c.customerNumber
              order by total DESC;     ''').fetchall()

[('Euro+ Shopping Channel', '1982 Camaro Z28', 259),
 ('Mini Gifts Distributors Ltd.',
  '1938 Cadillac V-16 Presidential Limousine',
  180),
 ('Australian Collectors, Co.', '1940s Ford truck', 55),
 ('La Rochelle Gifts', 'Diamond T620 Semi-Skirted Tanker', 53),
 ('AV Stores, Co.', '1936 Mercedes Benz 500k Roadster', 51),
 ('Land of Toys Inc.', 'Boeing X-32A JSF', 49),
 ('Muscle Machine Inc', '1954 Greyhound Scenicruiser', 48),
 ('Rovelli Gifts', 'American Airlines: MD-11S', 48),
 ("Kelly's Gift Shop", '1997 BMW F650 ST', 48),
 ("Anna's Decorations, Ltd", '1938 Cadillac V-16 Presidential Limousine', 46),
 ('Souveniers And Things Co.', '1936 Mercedes Benz 500k Roadster', 46),
 ('Down Under Souveniers, Inc', '1961 Chevrolet Impala', 46),
 ('Dragon Souveniers, Ltd.', '1997 BMW F650 ST', 43),
 ('Saveley & Henriot, Co.', '1936 Mercedes Benz 500k Roadster', 41),
 ('Corporate Gift Ideas Co.', 'The Mayflower', 41),
 ('Reims Collectables', 'Boeing X-32A JSF', 41),
 ('Salzburg Collectables', '1956 Porsche 356A Coupe', 40),
 ('The Sharp Gifts Warehouse', '2002 Chevy Corvette', 40),
 ("L'ordine Souveniers", 'American Airlines: MD-11S', 39),
 ('Scandinavian Gift Ideas', '1960 BSA Gold Star DBD34', 38),
 ('Danish Wholesale Imports', '1948 Porsche Type 356 Roadster', 36),
 ('Handji Gifts& Co', '1939 Chevrolet Deluxe Coupe', 36),
 ('Mini Creations Ltd.', '2002 Yamaha YZR M1', 35),
 ('Technics Stores Inc.', '1997 BMW R 1100 S', 34),
 ('Online Diecast Creations Co.',
  '1938 Cadillac V-16 Presidential Limousine',
  34),
 ('Baane Mini Imports', '1962 City of Detroit Streetcar', 32),
 ('Oulu Toy Supplies, Inc.', 'Pont Yacht', 32),
 ('Tokyo Collectables, Ltd', '1936 Mercedes Benz 500k Roadster', 32),
 ('Corrida Auto Replicas, Ltd', '1982 Camaro Z28', 32),
 ('Diecast Classics Inc.', '1936 Mercedes-Benz 500K Special Roadster', 31),
 ('Vida Sport, Ltd', '1961 Chevrolet Impala', 31),
 ('Toys of Finland, Co.', '1992 Ferrari 360 Spider red', 30),
 ('Toys4GrownUps.com', '1982 Lamborghini Diablo', 30),
 ('Suominen Souveniers', '1997 BMW F650 ST', 30),
 ('Signal Gift Stores', '1936 Mercedes Benz 500k Roadster', 29),
 ('Herkku Gifts', '1938 Cadillac V-16 Presidential Limousine', 29),
 ('UK Collectables, Ltd.', '2002 Yamaha YZR M1', 29),
 ('Extreme Desk Decorations, Ltd', '2002 Yamaha YZR M1', 29),
 ('Heintze Collectables', 'The Mayflower', 27),
 ("Marta's Replicas Co.", 'Diamond T620 Semi-Skirted Tanker', 27),
 ('Auto Canal+ Petit', '1960 BSA Gold Star DBD34', 27),
 ('giftsbymail.co.uk', 'Boeing X-32A JSF', 26),
 ('Amica Models & Co.', 'Pont Yacht', 26),
 ('Toms SpezialitÃ¤ten, Ltd', '1982 Ducati 996 R', 26),
 ('Royal Canadian Collectables, Ltd.', 'Pont Yacht', 26),
 ('Mini Classics', 'American Airlines: MD-11S', 26),
 ('Stylish Desk Decors, Co.', 'Corsair F4U ( Bird Cage)', 26),
 ('GiftsForHim.com', '1936 Chrysler Airflow', 26),
 ('Gifts4AllAges.com', 'Pont Yacht', 26),
 ('Cruz & Sons Co.', '1982 Ducati 900 Monster', 26),
 ('FunGiftIdeas.com', 'ATA: B757-300', 26),
 ('Gift Depot Inc.', '1962 City of Detroit Streetcar', 25),
 ('Vitachrome Inc.', '1982 Camaro Z28', 25),
 ('Collectable Mini Designs Co.', '2002 Chevy Corvette', 25),
 ('Petit Auto', '1936 Chrysler Airflow', 25),
 ('Marseille Mini Autos', '1982 Ducati 996 R', 25),
 ('Norway Gifts By Mail, Co.', '1956 Porsche 356A Coupe', 24),
 ('Collectables For Less Inc.', '1936 Chrysler Airflow', 24),
 ("La Corne D'abondance, Co.", '1982 Camaro Z28', 23),
 ('Enaco Distributors', 'ATA: B757-300', 23),
 ('Australian Collectables, Ltd', 'Boeing X-32A JSF', 23),
 ('Motor Mint Distributors Inc.', '2002 Yamaha YZR M1', 23),
 ('Blauer See Auto, Co.', '1940s Ford truck', 22),
 ('Canadian Gift Exchange Network', '1982 Camaro Z28', 22),
 ('QuÃ©bec Home Shopping Network', '1982 Camaro Z28', 22),
 ('Mini Wheels Co.', '1996 Peterbilt 379 Stake Bed with Outrigger', 21),
 ('Tekni Collectables Inc.', 'American Airlines: MD-11S', 21),
 ('Classic Gift Ideas, Inc', 'Boeing X-32A JSF', 21),
 ('Daedalus Designs Imports', '2002 Yamaha YZR M1', 20),
 ('Osaka Souveniers Co.', '1948 Porsche Type 356 Roadster', 20),
 ('Alpha Cognac', 'Pont Yacht', 20),
 ('Lyon Souveniers', '1962 City of Detroit Streetcar', 20),
 ('Classic Legends Inc.', 'Pont Yacht', 20),
 ('Volvo Model Replicas, Co', '1962 Volkswagen Microbus', 19),
 ('Mini Caravy', '1956 Porsche 356A Coupe', 19),
 ('Gift Ideas Corp.', 'F/A 18 Hornet 1/72', 19),
 ('Auto AssociÃ©s & Cie.', '1982 Camaro Z28', 18),
 ('Diecast Collectables', '1939 Chevrolet Deluxe Coupe', 18),
 ('Super Scale Inc.', '1982 Camaro Z28', 17),
 ('Clover Collections, Co.', 'ATA: B757-300', 16),
 ('King Kong Collectables, Co.', 'ATA: B757-300', 16),
 ('Online Mini Collectables', 'The Queen Mary', 15),
 ('Australian Gift Network, Co', '1928 British Royal Navy Airplane', 15),
 ('Mini Auto Werke', '1917 Maxwell Touring Car', 15),
 ('Iberia Gift Imports, Corp.', '1936 Mercedes Benz 500k Roadster', 15),
 ('Signal Collectibles Ltd.', '1954 Greyhound Scenicruiser', 15),
 ("Men 'R' US Retailers, Ltd.", 'Boeing X-32A JSF', 14),
 ('Bavarian Collectables Imports, Co.', 'Boeing X-32A JSF', 14),
 ('CAF Imports', '1969 Ford Falcon', 13),
 ('West Coast Collectables Co.', '1936 Chrysler Airflow', 13),
 ('Double Decker Gift Stores, Ltd', '1952 Citroen-15CV', 12),
 ('Cambridge Collectables Co.', 'Boeing X-32A JSF', 11),
 ('Microscale Inc.', '2002 Yamaha YZR M1', 10),
 ('Auto-Moto Classics Inc.', 'Boeing X-32A JSF', 8),
 ('Royale Belge', '1992 Ferrari 360 Spider red', 8),
 ('Frau da Collezione', '1992 Ferrari 360 Spider red', 8),
 ('Atelier graphique', '1938 Cadillac V-16 Presidential Limousine', 7),
 ('Boards & Toys Co.', '1968 Dodge Charger', 3)]

## Select the Employee Number, Office Code, City (of the office), and Name (First and Last) of those Employees who Sold Products that Have Been Ordered by Less Then 20 people.

This problem is a bit tougher. To start, think about how you might break the problem up. Be sure that your results only list each employee once.

In [8]:
#Your code here

"""c.execute(''' select e.employeeNumber, of.officeCode, of.city, e.firstName, e.lastName, count(*) as total from employees e, 
                       offices of, 
                       customers c, 
                       orders o, 
                       orderDetails od,
                       products p
                       where (of.officeCode=e.officeCode and
                              e.employeeNumber=c.salesRepEmployeeNumber and
                              c.customerNumber=o.customerNumber and
                              o.orderNumber=od.orderNumber and
                              od.productCode=p.productCode)
                       group by c.customerNumber,p.productCode
                       having(total < 20)
                       ;''').fetchall()
"""

c.execute( """ select DISTINCT e.employeeNumber, of.officeCode, of.city, e.firstName, e.lastName 
                            from employees e, 
                                 offices of, 
                                 customers c, 
                                 orders o, 
                                 orderDetails od
                              
                              where of.officeCode=e.officeCode and
                                 e.employeeNumber=c.salesRepEmployeeNumber and
                                 c.customerNumber=o.customerNumber and
                                 o.orderNumber=od.orderNumber and
                                 od.productCode in
                                 
                                
                             (select productCode from (select p.productCode, count(*) as total from customers c, 
                              orders o, 
                              orderDetails od,
                              products p
                              where (c.customerNumber=o.customerNumber and
                                     o.orderNumber=od.orderNumber and
                                     od.productCode=p.productCode) 
                              group by p.productCode, c.customerNumber)
                              
                              group by productCode
                              having(count(*) <20))
                              
                              
                              
                              ;""").fetchall()

[('1370', '4', 'Paris', 'Gerard', 'Hernandez'),
 ('1501', '7', 'London', 'Larry', 'Bott'),
 ('1337', '4', 'Paris', 'Loui', 'Bondur'),
 ('1166', '1', 'San Francisco', 'Leslie', 'Thompson'),
 ('1286', '3', 'NYC', 'Foon Yue', 'Tseng'),
 ('1612', '6', 'Sydney', 'Peter', 'Marsh'),
 ('1611', '6', 'Sydney', 'Andy', 'Fixter'),
 ('1401', '4', 'Paris', 'Pamela', 'Castillo'),
 ('1621', '5', 'Tokyo', 'Mami', 'Nishi'),
 ('1323', '3', 'NYC', 'George', 'Vanauf'),
 ('1165', '1', 'San Francisco', 'Leslie', 'Jennings'),
 ('1702', '4', 'Paris', 'Martin', 'Gerard'),
 ('1216', '2', 'Boston', 'Steve', 'Patterson'),
 ('1188', '2', 'Boston', 'Julie', 'Firrelli'),
 ('1504', '7', 'London', 'Barry', 'Jones')]

## Select the Employee Number, Name (First and Last) and Number of Customers of Employees Who's Customers Have an Average Credit Limit of Over 15K

In [10]:
c.execute( """ 
select DISTINCT e.employeeNumber, e.firstName, e.LastName, 
count(*) as num_customers

    from employees e, 
         offices of, 
         customers c

      where e.employeeNumber=c.salesRepEmployeeNumber

        and e.employeeNumber in 
        (select salesRepEmployeeNumber from customers
        group by salesRepEmployeeNumber

        having(avg(creditLimit)>15000)
        )
group by employeeNumber
                                 

""").fetchall()

[('1165', 'Leslie', 'Jennings', 42),
 ('1166', 'Leslie', 'Thompson', 42),
 ('1188', 'Julie', 'Firrelli', 42),
 ('1216', 'Steve', 'Patterson', 42),
 ('1286', 'Foon Yue', 'Tseng', 49),
 ('1323', 'George', 'Vanauf', 56),
 ('1337', 'Loui', 'Bondur', 42),
 ('1370', 'Gerard', 'Hernandez', 49),
 ('1401', 'Pamela', 'Castillo', 70),
 ('1501', 'Larry', 'Bott', 56),
 ('1504', 'Barry', 'Jones', 63),
 ('1611', 'Andy', 'Fixter', 35),
 ('1612', 'Peter', 'Marsh', 35),
 ('1621', 'Mami', 'Nishi', 35),
 ('1702', 'Martin', 'Gerard', 42)]

## Summary

In this lesson, you got to practice some more complex SQL queries, some of which required subqueries. There's still plenty more SQL to be had though; hope you've been enjoying some of these puzzles!